hubuhubu/nrf52-ble-mesh-data-collector/ble_app_uart - Mesh - Gateway/main.c
    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
		err_code = app_timer_create(&m_one_second_tick_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                one_second_tick_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_one_second_tick_timer_id, ONE_SECOND_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{

}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
        .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(CONN_CFG_TAG);
}


/**@snippet [LED Initialization] */
void leds_buttons_init(void)
{
    nrf_gpio_cfg_output(LED_1);
    nrf_gpio_cfg_output(LED_2);
    nrf_gpio_cfg_output(LED_4);
    nrf_gpio_cfg_output(LED_3);
    nrf_gpio_pin_set(LED_1);
    nrf_gpio_pin_set(LED_2);
    nrf_gpio_pin_set(LED_3);
    nrf_gpio_pin_set(LED_4);
    nrf_gpio_cfg_input(BUTTON_1, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(BUTTON_2, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(BUTTON_3, NRF_GPIO_PIN_PULLUP);
    nrf_gpio_cfg_input(BUTTON_4, NRF_GPIO_PIN_PULLUP);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function forallocating handle ID for a sensor
 */
uint16_t allocate_handle_ID(uint16_t chip_id)
{
	uint32_t i,ret;
	for (i = NODE_ID_START; i < MAX_NODE+NODE_ID_START; i++)
	{
		if (Node_ID_table[i] == chip_id) 
		{
			return i;
		}
	}
	for (i = NODE_ID_START; i < MAX_NODE+NODE_ID_START; i++)			
	{
		if (Node_ID_table[i] == INVALID_CHIP_ID) 
		{
            Node_ID_table[i] = (uint32_t)chip_id;
            fs_callback_flag = 1;
                    
            ret = fs_store(&fs_config, fs_config.p_start_addr + i, &Node_ID_table[i], 1, NULL);  
           
            if (ret == FS_SUCCESS)
            {
                while(fs_callback_flag == 1)  
                { 
                    power_manage(); 
                }		
            }		
            return i;
        }
	}
	return NETWORK_FULL;	
}


/**
* @brief RBC_MESH framework event handler. Defined in rbc_mesh.h. Handles
*   events coming from the mesh. Sets LEDs according to data
*
* @param[in] evt RBC event propagated from framework
*/
static void rbc_mesh_event_handler(rbc_mesh_event_t* p_evt)
{ 	
    uint8_t mesh_data[5];
    //For debugging checking comming value type
    switch (p_evt->type)
    {
        case RBC_MESH_EVENT_TYPE_CONFLICTING_VAL:
            //NRF_LOG_INFO("\r\nCONFLICT VAL!");
            break;
        
        case RBC_MESH_EVENT_TYPE_NEW_VAL:
            //NRF_LOG_INFO("\r\nNEW VAL!");
            break;
        
        case RBC_MESH_EVENT_TYPE_UPDATE_VAL:
            //NRF_LOG_INFO("\r\nUpdate VAL!");

            switch (p_evt->params.rx.value_handle)
            {
                case COMMISSION_HANDLE:
                    NRF_LOG_INFO("\r\nCommission request!");
                    
                    if ((p_evt->params.rx.p_data[0] == REQUEST_HANDLE_OPCODE) && (p_evt->params.rx.data_len == 3)&&(reinitialize_countdown==0))
                    {
                        uint16_t chip_id, handle_ID;
                        chip_id	= ((uint16_t)p_evt->params.rx.p_data[1] << 8) | p_evt->params.rx.p_data[2];
                        handle_ID = allocate_handle_ID(chip_id);
                        if (handle_ID != NETWORK_FULL)
                        {
                            NRF_LOG_INFO("\r\nAssigned new Handle ID_!");
                            mesh_data[0] = ASSIGN_HANDLE_OPCODE;
                            mesh_data[1] = chip_id >> 8;
                            mesh_data[2] = chip_id;
                            mesh_data[3] = handle_ID >> 8;
                            mesh_data[4] = handle_ID;
                            rbc_mesh_value_set(COMMISSION_HANDLE, mesh_data, 5);    
                        }
                        else
                        {
                            NRF_LOG_INFO("\r\nNetwork full, rejected request!");
                        }
                    }
                    break;
                       
                default:
                    /*printf("\r\nID_: %d[",p_evt->params.rx.value_handle,p_evt->params.rx.data_len);
                    for (uint8_t i=0;i < p_evt->params.rx.data_len;i++) printf("%d-",p_evt->params.rx.p_data[i]);
                    printf("]");*/
                    active_sensors[p_evt->params.rx.value_handle-NODE_ID_START] = 10;
                    //Update data in to database
                    memcpy(&sensor_data[(p_evt->params.rx.value_handle-NODE_ID_START) * SENSOR_DATA_SIZE], p_evt->params.rx.p_data, p_evt->params.rx.data_len);
                    if ((!(p_evt->params.rx.p_data[0] % 2)) && (p_evt->params.rx.value_handle-NODE_ID_START < 4))
                    {
                        NRF_GPIO->OUTSET = (1 << (p_evt->params.rx.value_handle + LED_START - NODE_ID_START));
                    }
                    else
                    {
                        NRF_GPIO->OUTCLR = (1 << (p_evt->params.rx.value_handle + LED_START - NODE_ID_START));
                    }
                    break;              
            }           
            break;

        case RBC_MESH_EVENT_TYPE_TX:
            break;

        case RBC_MESH_EVENT_TYPE_INITIALIZED:
            /* init BLE gateway softdevice application: */
            //nrf_adv_conn_init();
            break;
        
        default:
            break;
    }   
}


static void fs_evt_handler(fs_evt_t const * const evt, fs_ret_t result)
{
    if (result != FS_SUCCESS)
    {
        printf("    ISSUE   \n\r");
        //bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
    }
    else
    {
        printf("    fstorage command successfully completed   \n\r");
        fs_callback_flag = 0;
    }
}

/**
* @brief initialize_node_id_table  initialize the node id table. Erase the stored table if Button 4 is pressed
* Otherwise read from flash to restore the table
*/
void initialize_node_id_table(void)
{
    //If button 4 is pressed , erase Node_ID_table , otherwise restore it from flash
    if(nrf_gpio_pin_read(BUTTON_4) == 0)
    {
        memset(Node_ID_table, INVALID_CHIP_ID, sizeof(Node_ID_table));  
        fs_callback_flag = 1;
        uint32_t ret = fs_erase(&fs_config, fs_config.p_start_addr, 1, NULL);
		APP_ERROR_CHECK(ret);
		while(fs_callback_flag == 1);
    }
    else
    {
        memcpy(Node_ID_table, fs_config.p_start_addr, sizeof(Node_ID_table));
    }
    
