hubuhubu/nrf52-ble-mesh-data-collector/ble_app_uart - Mesh - Gateway/main.c
}  

void mesh_init(void )
{
    uint8_t mesh_data[2];
    uint32_t err_code;
    rbc_mesh_init_params_t init_params;
    init_params.access_addr = MESH_ACCESS_ADDR;
    init_params.interval_min_ms = MESH_INTERVAL_MIN_MS;
    init_params.channel = MESH_CHANNEL;
    init_params.lfclksrc = MESH_CLOCK_SOURCE;
    init_params.tx_power = RBC_MESH_TXPOWER_0dBm ;
    
    err_code = rbc_mesh_init(init_params);
    APP_ERROR_CHECK(err_code);

    /* enable handle ID for all nodes and the commision handle*/
    for (uint32_t i = 0; i < MAX_NODE+NODE_ID_START; i++)
    {
        err_code = rbc_mesh_value_enable(i);
        APP_ERROR_CHECK(err_code);
    }
	//Set initial version for commission handle
    err_code = rbc_mesh_value_set(COMMISSION_HANDLE, mesh_data, 0);    
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;
    rbc_mesh_event_t evt;
    
    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	timers_init();

    uart_init();
    log_init();

    leds_buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    fs_init();
    initialize_node_id_table();
	mesh_init();
    NRF_LOG_INFO("Mesh Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    application_timers_start();
    
    // Enter main loop.
    for (;;)
    {
        if (rbc_mesh_event_get(&evt) == NRF_SUCCESS)
        {   
            rbc_mesh_event_handler(&evt);
            rbc_mesh_event_release(&evt);
        }
        if(nrf_gpio_pin_read(BUTTON_4) == 0)
        {
            reinitialize_countdown=10;
        }
            

    }
}


/**
 * @}
 */
